In [3]:
import pandas as pd

df = pd.read_csv('csv_data/a1.csv')
df

    姓名  國文  英文  數學  自然  社會
0  張彥博  77  66  57  75  91
1  陳倩潔  80  97  66  93  71
2  林清英  56  50  87  75  60

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   姓名      3 non-null      object
 1   國文      3 non-null      int64
 2   英文      3 non-null      int64
 3   數學      3 non-null      int64
 4   自然      3 non-null      int64
 5   社會      3 non-null      int64
dtypes: int64(5), object(1)
memory usage: 276.0+ bytes

In [5]:
s1 = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
s1

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [6]:
s1.reindex(['a','b','c','d'])

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [7]:
s1.drop(['a','b'],inplace = True)

In [8]:
s1

d    4.5
c    3.6
dtype: float64

In [9]:
s1.reindex(['a','b','c'])

a    NaN
b    NaN
c    3.6
dtype: float64

In [32]:
s2 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
s2

0      blue
2    purple
4    yellow
dtype: object

In [33]:
s2.drop([0,2],inplace = True)

In [34]:
s2

4    yellow
dtype: object

In [12]:
s2.loc[0:4]

2    purple
4    yellow
dtype: object

In [13]:
s2.reindex(range(6))

0       NaN
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [14]:
import numpy as np
import pandas as pd
df = pd.DataFrame(np.arange(9).reshape(3,3),
             index=['a','c','d'],
             columns=['台北', '台中', '高雄'])
df

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [15]:
df.reindex(['a','b','c','d'])

    台北   台中   高雄
a  0.0  1.0  2.0
b  NaN  NaN  NaN
c  3.0  4.0  5.0
d  6.0  7.0  8.0

In [16]:
df.reindex(['a','c'])

   台北  台中  高雄
a   0   1   2
c   3   4   5

In [17]:
df.reindex(columns=['台北','高雄'])

   台北  高雄
a   0   2
c   3   5
d   6   8

In [18]:
df[['台北','高雄']]

   台北  高雄
a   0   2
c   3   5
d   6   8

In [19]:
df.reindex(columns=['台北','高雄'],index=['a','d'])

   台北  高雄
a   0   2
d   6   8

In [20]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [21]:
print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [22]:
data.drop(['台北','台中'],axis=0)

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [35]:
data.drop(['one','two'],axis = 1)

    three  four
台中      6     7
台南     10    11
高雄     14    15

In [23]:
data.drop(['one','two'],axis='columns')

    three  four
台北      2     3
台中      6     7
台南     10    11
高雄     14    15

In [24]:
data.drop('台北',inplace=True)#預設inplace=False傳出新的資料，但不改變資料，而inplace=True就是不傳出直接刪除資料

In [25]:
data

    one  two  three  four
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15